src/InformationRegisters/ИсторияРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРегламентныхЗаданий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеЗадания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияРегламентныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СобытияРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СобытияРегламентныхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УспешноЗавершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Включение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеНастроек</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ИсторияРегламентныхЗаданий/Ext/ManagerModule.bsl
Процедура ЗафиксироватьЗапускРегламентногоЗадания(РегламентноеЗадание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Запуск");
	МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	МенеджерЗаписи.Начало = ТекущаяДатаСеанса();
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьЗавершениеРегламентногоЗадания(РегламентноеЗадание) Экспорт
	
	НаборЗаписей = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегламентноеЗадание.Установить(РегламентноеЗадание);
	НаборЗаписей.Отбор.Событие.Установить(ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Запуск"));
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Отбор.Завершено.Установить(Ложь);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 1 Тогда
		Запись = НаборЗаписей[0];
		Запись.Конец = ТекущаяДатаСеанса();
		Запись.Длительность = ТекущаяДатаСеанса() - Запись.Начало;
		Запись.Завершено = Ложь;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьОшибкуРегламентногоЗадания(РегламентноеЗадание, ОписаниеОшибки) Экспорт
	НаборЗаписей = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегламентноеЗадание.Установить(РегламентноеЗадание);
	НаборЗаписей.Отбор.Событие.Установить(ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Запуск"));
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Отбор.Завершено.Установить(Ложь);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекущаяДатаСеанса();
		//Запись.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Ошибка");
		Запись.ОписаниеОшибки = ОписаниеОшибки;
		Запись.Начало = ТекущаяДатаСеанса();
		Запись.Конец = ТекущаяДатаСеанса();
		Запись.Длительность = 0;

	Иначе
		Запись = НаборЗаписей[0];
		Запись.Конец = ТекущаяДатаСеанса();
		Запись.Длительность = ТекущаяДатаСеанса() - Запись.Начало;
		Запись.Ошибка = Истина;
		Запись.ОписаниеОшибки = ОписаниеОшибки;
		//Запись.Завершено = Истина;

	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьИзмененияНастроекРегламентогоЗадания(РегламентноеЗадание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.ИзменениеНастроек");
	МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	МенеджерЗаписи.Начало = ТекущаяДатаСеанса();
	МенеджерЗаписи.ОписаниеОшибки = "Изменены настройки";
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;

	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьВключениеРегламентногоЗадания(РегламентноеЗадание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Включение");
	МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	МенеджерЗаписи.Начало = ТекущаяДатаСеанса();
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;

	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьОтключениеРегламентногоЗадания(РегламентноеЗадание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Отключение");
	МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	МенеджерЗаписи.Начало = ТекущаяДатаСеанса();
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;

	МенеджерЗаписи.Записать();
	
КонецПроцедуры
